BAS BMEKZU Project/src/InformationRegisters/НастройкаПечатиНалоговыхДокументов/НастройкаПечатиНалоговыхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкаПечатиНалоговыхДокументов</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>ВыводитьНомерДоговораБезКлеточек</name>
    <comment>Чем заполнять пустые показатели (с 2011 г.): Знаком &quot;X&quot;, &quot;-&quot;, или пустой строкой, например</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДополнятьНаименованиеАдресДаннымиГоловнойОрганизацииВНН</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеДополнятьНаименованиеНомеромГТДВНалоговыхДокументах</name>
    <comment>только для формы по приказу 1379</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПечататьДатыВНалоговыхНакладныхСРазделителями</name>
    <comment>только для формы по приказу 1379</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПечататьКодУКТВЭДБезПробелов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПечататьТитульныйЛистДляПриложения2КНалоговойНакладной</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СимволПустыхПоказателейВНалоговойНакладной</name>
    <comment>Чем заполнять пустые показатели (с 2011 г.): Знаком &quot;X&quot;, &quot;-&quot;, или пустой строкой, например</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыгрузкаПечатьНН_ПоФормеНаДатуДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BAS BMEKZU Project/src/InformationRegisters/НастройкаНумерацииНалоговыхДокументов/НастройкаНумерацииНалоговыхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкаНумерацииНалоговыхДокументов</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>ВестиДневнуюНумерациюНалоговыхДокументов</name>
    <comment>Возможность вести нумерацию Налоговых накладных и Приложений 2 с № 1 каждый день</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВестиМесячнуюНумерациюНалоговыхДокументов</name>
    <comment>Возможность вести нумерацию Налоговых накладных и Приложений 2 с № 1 каждый месяц</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВестиНумерациюНалоговыхДокументовБезУчетаОбособленныхПодразделений</name>
    <comment>Возможность вести нумерацию налоговых документов без учета обособленных подразделений, в случае, когда обособленные подразделения указаны в документах</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВестиРаздельнуюНумерациюНалоговыхДокументов</name>
    <comment>Разные нумераторы для Налоговой накладной и Приложения 2 к налоговой накладной</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВестиРаздельнуюНумерациюНалоговыхДокументовПоНеНДСОперациям</name>
    <comment>Технологические налоговые документы &quot;Не НДС&quot; не будут занимать номера обычных налоговых</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВестиРаздельнуюНумерациюНалоговыхДокументовПоСпецРежимам</name>
    <comment>Разные нумераторы для Налоговой накладной и Приложения 2 к налоговой накладной для разных спец. режимов</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВестиРаздельнуюНумерациюНалоговыхНакладныхПоОбычнымЦенам</name>
    <comment>Будут ли налоговые накладные по ОЦ занимать номер налогой накладной или будут иметь тот же номер, что и основаная налоговая (но тип причины невыдачи = 01)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BAS BMEKZU Project/src/Catalogs/НалоговыеНазначенияАктивовИЗатрат/НалоговыеНазначенияАктивовИЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НалоговыеНазначенияАктивовИЗатрат</name>
  <comment>(Регл)</comment>
  <predefined>
    <items>
      <name>НКУ_БытУслуги</name>
      <description>Быт. усл. (пат.)</description>
    </items>
    <items>
      <name>БытУслуги</name>
      <description>Быт. усл. (пат.)</description>
    </items>
    <items>
      <name>БытУслугиАморт</name>
      <description>Быт. усл. (пат.), аморт.</description>
    </items>
    <items>
      <name>БытУслугиАмортНеОблагНДС</name>
      <description>Быт. усл. (пат.), аморт., не обл. НДС</description>
    </items>
    <items>
      <name>БытУслугиНеОблагНДС</name>
      <description>Быт. усл. (пат.), не обл. НДС</description>
    </items>
    <items>
      <name>НКУ_ИгорБизнес</name>
      <description>Игор. бизнес (пат.)</description>
    </items>
    <items>
      <name>ИгорБизнес</name>
      <description>Игор. бизнес (пат.)</description>
    </items>
    <items>
      <name>ИгорБизнесАморт</name>
      <description>Игор. бизнес (пат.), аморт.</description>
    </items>
    <items>
      <name>ИгорБизнесАмортНеОблагНДС</name>
      <description>Игор. бизнес (пат.), аморт., не обл. НДС</description>
    </items>
    <items>
      <name>ИгорБизнесНеОблагНДС</name>
      <description>Игор. бизнес (пат.), не обл. НДС</description>
    </items>
    <items>
      <name>НДС_НеоблагаемаяХозДеятельность</name>
      <description>Необл. НДС, любая хоз.</description>
    </items>
    <items>
      <name>НДС_НеоблагаемаяНеХозДеятельность</name>
      <description>Необл. НДС, нехоз.</description>
    </items>
    <items>
      <name>НКУ_НеХозДеятельность</name>
      <description>Нехоз. д-сть</description>
    </items>
    <items>
      <name>НеХозДеятельность</name>
      <description>Нехоз. д-сть</description>
    </items>
    <items>
      <name>НеХозДеятельностьАморт</name>
      <description>Нехоз. д-сть, аморт.</description>
    </items>
    <items>
      <name>НеХозДеятельностьАмортНеОблагНДС</name>
      <description>Нехоз. д-сть, аморт., не обл. НДС</description>
    </items>
    <items>
      <name>НеХозДеятельностьНеОблагНДС</name>
      <description>Нехоз. д-сть, не обл. НДС</description>
    </items>
    <items>
      <name>НДС_Облагаемая</name>
      <description>Обл. НДС</description>
    </items>
    <items>
      <name>ОбмВалюты</name>
      <description>Обм. вал. (пат.)</description>
    </items>
    <items>
      <name>НКУ_ОбмВалюты</name>
      <description>Обм. вал. (пат.)</description>
    </items>
    <items>
      <name>ОбмВалютыАморт</name>
      <description>Обм. вал. (пат.), аморт.</description>
    </items>
    <items>
      <name>ОбмВалютыАмортНеОблагНДС</name>
      <description>Обм. вал. (пат.), аморт., не обл. НДС</description>
    </items>
    <items>
      <name>ОбмВалютыНеОблагНДС</name>
      <description>Обм. вал. (пат.), не обл. НДС</description>
    </items>
    <items>
      <name>НКУ_Освобожденная</name>
      <description>Освобожд. ( п. 154.6 НКУ)</description>
    </items>
    <items>
      <name>НКУ_ПрограммнаяПродукция</name>
      <description>Прогр. прод. (субъекты индустрии)</description>
    </items>
    <items>
      <name>НДС_Пропорционально</name>
      <description>Пропорц. обл. НДС</description>
    </items>
    <items>
      <name>НКУ_Распределяемая</name>
      <description>Распределяемая</description>
    </items>
    <items>
      <name>НКУ_ТоргДеятельность</name>
      <description>Торг. д-сть (пат.)</description>
    </items>
    <items>
      <name>ТоргДеятельность</name>
      <description>Торг. д-сть (пат.)</description>
    </items>
    <items>
      <name>ТоргДеятельностьАморт</name>
      <description>Торг. д-сть (пат.), аморт.</description>
    </items>
    <items>
      <name>ТоргДеятельностьАмортНеОблагНДС</name>
      <description>Торг. д-сть (пат.), аморт., не обл. НДС</description>
    </items>
    <items>
      <name>ТоргДеятельностьНеОблагНДС</name>
      <description>Торг. д-сть (пат.), не обл. НДС</description>
    </items>
    <items>
      <name>ХозДеятельность</name>
      <description>Хоз. д-сть</description>
    </items>
    <items>
      <name>НКУ_ХозДеятельность</name>
      <description>Хоз. д-сть</description>
    </items>
    <items>
      <name>ХозДеятельностьАморт</name>
      <description>Хоз. д-сть, аморт.</description>
    </items>
    <items>
      <name>ХозДеятельностьАмортНеОблагНДС</name>
      <description>Хоз. д-сть, аморт., не обл. НДС</description>
    </items>
    <items>
      <name>ХозДеятельностьНеОблагНДС</name>
      <description>Хоз. д-сть, не обл. НДС</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидНалоговойДеятельности</name>
    <type>
      <types>CatalogRef.ВидыНалоговойДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Амортизируется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельностиНДС</name>
    <type>
      <types>EnumRef.ВидыДеятельностиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаНалоговогоНазначения</name>
    <type>
      <types>EnumRef.ГруппыНалоговыхНазначений</types>
    </type>
  </attributes>
</mdclass:Catalog>

BAS BMEKZU Project/src/CommonModules/НалоговыйУчетПовтИсп/Module.bsl
Функция ДатаНачалаРаспределенияОПЗвНУ() Экспорт
	
	ДатаВступления = Константы.ДатаНачалаРаспределенияОПЗвНУ.Получить();	
	
	Если Не ЗначениеЗаполнено(ДатаВступления) Тогда
		ДатаВступления = '2011-08-01';
	КонецЕсли;
	
	Возврат ДатаВступления;	

КонецФункции 

Функция ДатаВступленияВСилуПриказа1379() Экспорт
	
	ДатаВступления = Константы.ДатаВступленияВСилуПриказа1379.Получить();	
	
	Если Не ЗначениеЗаполнено(ДатаВступления) Тогда
		ДатаВступления = '2011-12-16';
	КонецЕсли;
	
	Возврат ДатаВступления;	

КонецФункции 

Функция ДатаНачалаИспользованияФормыННПоЛекарствам() Экспорт
	
	ДатаНачала = Константы.ДатаНачалаИспользованияФормыННПоЛекарствам.Получить();	
	Если Не ЗначениеЗаполнено(ДатаНачала) Тогда
		ДатаНачала = '20141201';
	КонецЕсли;
	
	Возврат ДатаНачала;	

КонецФункции 

Функция НастройкаПечатиНалоговыхДокументов(Организация, Дата) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(Настройки.ВыводитьНомерДоговораБезКлеточек, ЛОЖЬ) КАК ВыводитьНомерДоговораБезКлеточек,
	               |	ЕСТЬNULL(Настройки.ДополнятьНаименованиеАдресДаннымиГоловнойОрганизацииВНН, ЛОЖЬ) КАК ДополнятьНаименованиеАдресДаннымиГоловнойОрганизацииВНН,
	               |	ЕСТЬNULL(Настройки.НеДополнятьНаименованиеНомеромГТДВНалоговыхДокументах, ЛОЖЬ) КАК НеДополнятьНаименованиеНомеромГТДВНалоговыхДокументах,
	               |	ЕСТЬNULL(Настройки.ПечататьДатыВНалоговыхНакладныхСРазделителями, ЛОЖЬ) КАК ПечататьДатыВНалоговыхНакладныхСРазделителями,
	               |	ЕСТЬNULL(Настройки.ПечататьКодУКТВЭДБезПробелов, ЛОЖЬ) КАК ПечататьКодУКТВЭДБезПробелов,
	               |	ЕСТЬNULL(Настройки.ПечататьТитульныйЛистДляПриложения2КНалоговойНакладной, ЛОЖЬ) КАК ПечататьТитульныйЛистДляПриложения2КНалоговойНакладной,
				   |	ЕСТЬNULL(Настройки.СимволПустыхПоказателейВНалоговойНакладной, ""X"") КАК СимволПустыхПоказателейВНалоговойНакладной,
				   |	ЕСТЬNULL(Настройки.ВыгрузкаПечатьНН_ПоФормеНаДатуДокумента, ЛОЖЬ) КАК ВыгрузкаПечатьНН_ПоФормеНаДатуДокумента
	               |ИЗ
	               |	(ВЫБРАТЬ 1) КАК СтрокаДанных
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаПечатиНалоговыхДокументов.СрезПоследних(&Дата, Организация = &Организация) КАК Настройки
	               |		ПО (ИСТИНА)";
				   
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	ТаблицаНастройки = Запрос.Выполнить().Выгрузить();
	СтрокаНастройки = ТаблицаНастройки[0];
	
	СтруктураНастройки = Новый Структура;
	
	Для каждого Настройка Из ТаблицаНастройки.Колонки Цикл
	
		СтруктураНастройки.Вставить(Настройка.Имя, СтрокаНастройки[Настройка.Имя]);	
	
	КонецЦикла;
	
	Возврат СтруктураНастройки;

КонецФункции
 
Функция НастройкаНумерацииНалоговыхДокументов(Организация, Дата) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(Настройки.ВестиМесячнуюНумерациюНалоговыхДокументов, ЛОЖЬ) 							КАК ВестиМесячнуюНумерациюНалоговыхДокументов,
				   |	ЕСТЬNULL(Настройки.ВестиДневнуюНумерациюНалоговыхДокументов, ЛОЖЬ) 								КАК ВестиДневнуюНумерациюНалоговыхДокументов,
				   |	ЕСТЬNULL(Настройки.ВестиНумерациюНалоговыхДокументовБезУчетаОбособленныхПодразделений, ЛОЖЬ) 	КАК ВестиНумерациюНалоговыхДокументовБезУчетаОбособленныхПодразделений,
				   |	ЕСТЬNULL(Настройки.ВестиРаздельнуюНумерациюНалоговыхДокументов, ЛОЖЬ) 							КАК ВестиРаздельнуюНумерациюНалоговыхДокументов,
	               |	ЕСТЬNULL(Настройки.ВестиРаздельнуюНумерациюНалоговыхДокументовПоНеНДСОперациям, ЛОЖЬ) 			КАК ВестиРаздельнуюНумерациюНалоговыхДокументовПоНеНДСОперациям,
	               |	ЕСТЬNULL(Настройки.ВестиРаздельнуюНумерациюНалоговыхДокументовПоСпецРежимам, ЛОЖЬ) 				КАК ВестиРаздельнуюНумерациюНалоговыхДокументовПоСпецРежимам,
	               |	ЕСТЬNULL(Настройки.ВестиРаздельнуюНумерациюНалоговыхНакладныхПоОбычнымЦенам, ЛОЖЬ) 				КАК ВестиРаздельнуюНумерациюНалоговыхНакладныхПоОбычнымЦенам
	               |ИЗ
	               |	(ВЫБРАТЬ 1) КАК СтрокаДанных
	               |	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаНумерацииНалоговыхДокументов.СрезПоследних(&Дата, Организация = &Организация) КАК Настройки
	               |		ПО (ИСТИНА)";
				   
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
				   
	ТаблицаНастройки = Запрос.Выполнить().Выгрузить();
	СтрокаНастройки = ТаблицаНастройки[0];
	
	СтруктураНастройки = Новый Структура;
	
	Для каждого Настройка Из ТаблицаНастройки.Колонки Цикл
	
		СтруктураНастройки.Вставить(Настройка.Имя, СтрокаНастройки[Настройка.Имя]);	
	
	КонецЦикла;
	
	Возврат СтруктураНастройки;

КонецФункции

Функция ЭтоНалоговоеНазначениеНДС(НалоговоеНазначение) Экспорт
	
	Если НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность 
		ИЛИ НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность
		ИЛИ НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая  
		ИЛИ НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Пропорционально Тогда
		
		Возврат Истина;
		
	Иначе 
		Возврат Ложь;
		
	КонецЕсли; 
	
КонецФункции
